## Plan Result (Managed_Identity_aat - Managed_Identity)




<pre><code>Plan: 1 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.genesis_rg_contributor[0]
* Update
  * azurerm_user_assigned_identity.sops-mi
  * azurerm_user_assigned_identity.wi-admin-mi




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.genesis_rg_contributor[0] will be created
  + resource "azurerm_role_assignment" "genesis_rg_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "9a2e3549-c5aa-4f7b-bcf8-1e1b3baf864c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/genesis-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_user_assigned_identity.sops-mi will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "sops-mi" {
        id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-aat-mi"
        name                = "aks-aat-mi"
      ~ tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "staging"
          - "startupMode"  = "always" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # azurerm_user_assigned_identity.wi-admin-mi will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "wi-admin-mi" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/managed-identities-aat-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/admin-aat-mi"
        name                = "admin-aat-mi"
      ~ tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "staging"
          - "startupMode"  = "always" -> null
        }
        # (5 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```

</details>





## :warning: Errors

* add a label Managed_Identity_aat - Managed_Identity/add-or-update: POST https://api.github.com/repos/hmcts/aks-cft-deploy/issues/695/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","PRNumber":695,"Program":"tfcmt","SHA1":"","Target":"Managed_Identity_aat - Managed_Identity","Vars":{}} -->